Permanent changes in the plan are still present.
TF init:
```
-▶ terraform init
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Using previously-installed cloudflare/cloudflare v5.6.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

Worker script TF code:
```
resource "cloudflare_workers_script" "some_worker" {
  account_id  = var.account_id
  script_name = "some-worker"
  content     = file("${path.module}/some-script/index.js")
  main_module = "index.js"
  observability = {
    enabled            = true
    head_sampling_rate = 0.1
  }
  bindings = [
    {
      name = "SOME_API_DOMAIN"
      type = "plain_text"
      text = var.some_api_endpoint
    },
    {
      name = "SOME_API_KEY"
      type = "secret_text"
      text = var.some_api_key
    }
  ]
  keep_bindings = ["plain_text", "secret_text"]
  placement = {
    mode = "smart"
  }
}
```

TF plan, which permanently shows changes after apply:
```
Terraform will perform the following actions:

  # cloudflare_workers_script.some_worker will be updated in-place
  ~ resource "cloudflare_workers_script" "some_worker" {
      ~ bindings            = [
          ~ {
                name         = "SOME_API_DOMAIN"
              + namespace_id = (known after apply)
                # (2 unchanged attributes hidden)
            },
          ~ {
                name         = "SOME_API_KEY"
              + namespace_id = (known after apply)
              + text         = (sensitive value)
                # (1 unchanged attribute hidden)
            },
        ]
      ~ etag                = "77f51b862afd6896c3fd3a60abc71154dab1238f60eed6d6f95e8ce286ed04aa" -> (known after apply)
      ~ has_assets          = false -> (known after apply)
      ~ has_modules         = true -> (known after apply)
        id                  = "some-worker"
      - main_module         = "index.js" -> null
      + migrations          = (known after apply)
      ~ modified_on         = "2025-07-03T07:44:55Z" -> (known after apply)
      ~ placement           = {
          + last_analyzed_at = (known after apply)
          + status           = (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ tail_consumers      = [] -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

I could provide debug logs as well if needed.